[
  {"title":"Bir Lachit Borphukan is an ‘Assamese Hero’ and not a ‘Hindu Hero’: Akhil Gogoi", "des":"Addressing media persons during the celebrations of the 400th birth anniversary of Bir Lachit Borphukan in Sivasagar, Akhil Gogoi said that BJP should stop playing politics in the name of Lachit Borphukan.", "img":"https://www.dropbox.com/s/uk16i458nzcn6wi/akhil_gogoi_0-sixteen_nine.webp?dl=1", "info":"Slamming Assam Chief Minister Himanta Biswa Sarma and BJP, MLA Akhil Gogoi on November 24 said that BJP’s sinister politics of projecting Bir Lachit Borphukan as a ‘Hindu Hero’ is a shame to the people of Assam. Addressing media persons during the celebrations of the 400th birth anniversary of Bir Lachit Borphukan in Sivasagar, Akhil Gogoi said that BJP should stop playing politics in the name of Lachit Borphukan.“Bir Lachit Borphukan is an Assamese hero and not a “Hindu Hero”. Bir Lachit Borphukan fought against the Mughals, defeated them and saved Assam. So, Bir Lachit Borphukan is an Assamese valiant warrior. Lachit Borphukan was neither an Indian hero nor a Hindu warrior, ‘Akhil Gogoi said. Gogoi said that BJP is playing Hindu-Muslim politics and are putting the name of our brave warrior in the middle of it. “This is never acceptable,” he said. Akhil Gogoi said that, if Lachit Borphukan is projected as a Hindu or Indian hero, the people of Assam will protest. He further added that the BJP government, instead of spreading the values and valour of Lachit Borphukan, is spending crores of taxpayers’ money to make him a Hindu warrior.” The 400th birth anniversary of the National Hero of Assam was celebrated on the premises of the historic Rang Ghar in Sivasagar.Earlier in the day, Prime Minister Narendra Modi paid tributes to Bir Lachit Borphukan on his 400th birth anniversary and said the leader epitomised unparalleled courage.Union Home Minister Amit Shah participated in the 400th birth anniversary celebration of Lachit Barphukan being celebrated in New Delhi. He also inaugurated a documentary on Lachit Borphukan on the occasion. Speaking on the same occasion Chief Minister Himanta Biswa Sarma urged the people of Assam to light an earthen lamp tonight as a mark of respect to the great warrior. He said the celebration of the 400th birth anniversary of Lachit Barphukan has re -united the Assamese society."},
  {"title":"Assam: 3 held for cattle smuggling in Golaghat", "des":"The cattle were reportedly transported from Athkheliya to Merapani in Golaghat.", "img":"https://www.dropbox.com/s/29zg3ns9w4olno2/cattle-sixteen_nine.webp?dl=1", "info":"Police arrested three suppliers, including an illegally smuggled cattle carrier in Merapani in Golaghat district.Merapani police seized the Tata Intra vehicle loaded with cattle in Gomariguri area no. 4 .The cattle were reportedly transported from Athkheliya to Merapani in Golaghat.The vehicle bearing registration number AS05-AC-1138 was seized in the process and seven cows were rescued from the smugglers.Police also seized a motorcycle bearing registration number AS05-Q-5162  which was used by the suppliers.Police have sent the cows Gaushala in Jorhat and are investigating the smugglers for further details.It is to be mentioned here that the apprehended persons were actively involved in illegally transporting cattle to Nagaland for a long time.Earlier on October 26, as many as 41 cattle heads were rescued from a container truck in Golaghat district in the morning of October 26.The container truck bearing registration number AS 01 CC 8143, was intercepted which was en route Nagaon’s Samuguri from Bokakhat’s Bihora cattle market. The police upon seizing the truck, arrested the vehicle’s driver in connection to the seizure.On October 25, Bokakhat Police seized one Scorpio, illegally transporting 6 cattle heads.Assam police on October 17 apprehended two cattle smugglers and recovered around 24 cattle heads in the state's Kaliabor town."},
  {"title":"Assam TET teachers killed in road accident in Gohpur, teachers stage protests", "des":"According to reports, two TET teachers Debajit Kakati and Debajit Sharma were killed in a road accident at Solengi in Gohpur.", "img":"https://www.dropbox.com/s/v0a1vu1268fwxw2/two%20teacher.webp?dl=1", "info":"More than 300 teachers on November 24 protested in front of the office Block Education Officer in Gohpur after two of their colleagues were killed in a road accident on November 23.  According to reports, two TET teachers Debajit Kakati and Debajit Sharma were killed in a road accident at Solengi in Gohpur. The incident happened on National Highway 15 on November 23. The two teachers were working as BRP and CRCC respectively. They were travelling in a motorcycle after performing office work in the evening. Angry teachers have now protested questioning the safety of teachers. They said that this is absolute mental harassment against the teachers. Teachers are made to work on festivals and office-related issues even after their duty hours are hours. The teachers blocked the gate of Chaiduar Block Education Officer and protested in front of his office. “We are made to work even after our duty hours are over. This is complete harassment. This should stop,” said a teacher while protesting. “We lost two of our colleagues yesterday and this is very unfortunate. Excessive work pressure is the main reason behind the incident. We don’t have a headmaster in our school and we are given the work of the headmaster which is not our responsibility. Administration and the Government should look into the matter and bring a solution as soon as possible.” said another teacher. “We never reach home on time because we are made to work in the name of office and festivals. We have a family to tend to and look after. This is mental harassment towards the teachers.” said another protesting teacher."},
  {"title":"Assam: Maharashtra CM Eknath Shinde to visit Kamakhya temple in Guwahati", "des":"As per sources, around two hundred members will be accompanied by the chief minister to seek blessing from Maa Kamakhya. The members will be flying in chartered flights.", "img":"https://www.dropbox.com/s/3q0lldtwwhhpfb5/many%20men.webp?dl=1", "info":"Maharashtra Chief Minister Eknath Shinde is scheduled to visit Kamakhya temple in Guwahati on November 26.As per reports, around two hundred members will be accompanied by the chief minister to seek blessing from Maa Kamakhya. The members will be flying in chartered flights.Notably, this is will be the Maharashtra CM's first visit to the state after rebelling against the Shiv Sena leadership and turning the political table of Maharashtra.It is to be mentioned here that earlier in June 2022, while CM Shinde and his 39 supporters were camping in Guwahati prior to forming the government, the team had visited the Kamakhya Temple.Read more: Maharashtra Assembly: CM Eknath Shinde wins trust vote with 164-99 marginIn June this year, Eknath Shinde-led government in Maharashtra prevailed in the floor test by a margin of 164 to 99, demonstrating the majority of his government and solidifying his position as the state's chief minister dethroning Uddhav Thackeray.The trust vote was proposed by BJP’s Sudhir Mungantiwar and Shiv Sena’s Bharat Gogawale. After a voice vote, on the proposal of the trust vote, opposition members demanded a division of the vote.Just prior to the trust vote, Santosh Bangar and Shyamsundar Shinde, two Uddhav Thackeray faction MLAs, switched allegiances.Eknath Shinde, who led a revolt against Shiv Sena leading to the collapse of the 31-month-old Maha Vikas Aghadi (MVA) government, took oath as the Chief Minister of Maharashtra on June 30."},
  {"title":"Assam: Drug addicts escape rehabilitation centre in Golaghat, attacks caretaker", "des":"Eight youths who were undergoing treatment at the rehabilitation centre called Blessing Care Foundation managed to escape after breaking the grill of the ventilator.", "img":"https://www.dropbox.com/s/kumr1qsxf250nz6/thief.webp?dl=1", "info":"A shocking incident took place at a rehabilitation centre in Old Amolapatti in the Golaghat district on November 24. Notably, eight drug addicts undergoing treatment at the rehabilitation centre have tactfully escaped from the centre. Eight of the 25 youths, who were undergoing treatment at the rehabilitation centre called Blessing Care Foundation, managed to escape after breaking the grill of the ventilator.Meanwhile, when a caretaker at the rehabilitation centre tried to stop them, he was attacked with a pen and escaped. The absconding youths have been identified as Ankur Gogoi, Samiran Shaym, Vinod Thakur, Vikash Basfar, Partha Pegu, Champak Bora, Hemant Mech and Amrit Chetri. All those who are absconding are from Golaghat and Jorhat districts, the authorities at the rehabilitation centre said. The youths are suspected to have fled the way due to excessive drug addiction. On the other hand, authorities at the rehabilitation centre have already reported the matter to the police and an investigation is underway.Earlier in November, a large quantity of Opium was seized in a narcotics control bureau operation at Rangajan in Golaghat.The NCB team also arrested three suppliers along with the Opium that was cleverly concealed inside the seat of a luxury vehicle. The detainees are Gurdeep Mann, Babu Singh and Balraj Singh, however, four are still absconding.The Swift VXI vehicle number AS01-AD-8182 was on its way to Numaligarh from Khatkhati in Karbi Anglong district when a team of Narcotics Control Bureau from Guwahati blocked and raided. During the search, the raiding team managed to seize about one kilogram of opium hidden under the seat of the vehicle. "},
  {"title":"Assam: 6 bighas of Satra land under grip of encroachers in Majuli, locals demand government’s intervention", "des":"Construction is being carried away at 6 bighas of land in Shantipur which belong to Kamalabari Satra.", "img":"https://www.dropbox.com/s/b5228uj9gll4svu/one%20men.webp?dl=1", "info":"The land of Kamalabari Satra located at Mahimabari in Titabar, Majuli is under encroachments. Notably, houses are being built at the land of the Satra in Shantipur. Satradhikar Bhavakantadev Goswami Kalakshetra was supposed to be built on the said land.The people of Shantipur village have now protested and are demanding the government to take action against the enroachers. Construction is being carried away at 6 bighas of land in Shantipur which belong to Kamalabari Satra.However, the people who are constructing their houses there claimed that the land was sold was to them without the knowledge of the satradhikar and they were unaware that the land belonged to the Satra.“ Land brokers are into this and they have already taken money from some people in the name of selling the land. We are surprised as well as worried as to how can these land brokers sell the land of the Satra. Some illegal immigrants are involved in the purchase. We demand government to take action against the land brokers and the enroachers” , said a villager while speaking to reporter. Notably, Assam government on September 2022, carried out major eviction drive in Sonitpur district to recover 330 acres of illegally encroached land. Last year on November 8, the Assam government carried out an eviction drive in the Lumding reserve forest in the Hojai district of Assam and recovered 1410 hectares of encroached forest land. Prior to this, an eviction drive conducted by the administration in Darrang district in Assam had turned violent after encroachers of the land attacked security forces. While 9 policemen were injured in the attack by the mob of illegal encroachers, 2 attackers were killed in retaliatory police firing."},
  {"title":"Assam: Son kills mother after she refused to provide money for mobile phone", "des":"A local commenting on the heinous crime said, The parents raised him with a lot of pain but for a simple phone killed his own mother by repeatedly hitting with an iron rod.", "img":"https://www.dropbox.com/s/p08b3nk0p001gi5/kill%20son%20to%20mother.webp?dl=1", "info":"A shocking murder came to light from the Changmai village in the Dibrugarh district, where a young man murdered his mother after she refused to provide him money to buy a mobile phone.As per reports, Jintu Das, son of Raju Das of Dibrugarh Changmai village, killed his mother Renu Das over a simple mobile phone. Notably, the accused wanted Rs 16,000 from his mother, however, she refused to give away the hard own money.In the hit of the moment, the accused son, hit his mother Mamta Das to death with a sharp iron rod following which he took away Rs 16,000 and bought a new cell phone.Post the incident, the killer was hiding at Chanmari Ghat in Dibrugarh Paltan Bazar. Later Lahowal police arrested accused Jintu Das from Chanmari Ghat and legal proceedings are underway."},
  {"title":"Assam: Elephant menace continues in Goalpara district, villagers pray to lord Ganesha", "des":"People in the Matia area of the Goalpara district have taken an innovative approach to eliminate wild elephant menace.", "img":"https://www.dropbox.com/s/byxnmb4wzh2zn21/pagoda.jpg?dl=1", "info":"Man-animal conflict continues in Assam, as wild elephant creates menace in Goalpara district raising fear among villagers. As per reports, residents are now scared to go out at night due to the ongoing elephant menace in the district as the forest department has failed to prevent the conflict.People in the Matia area of the Goalpara district have taken an innovative approach to eliminate wild elephant menace. People of the Shagunbahi-Gopalpur village of Matia have started praying to Lord Ganesha to get rid of the wild elephants. The wild elephant menace has been continuously on the rise in the Matia, Mornai, Dahikta and Rajapara areas of Goalpara for several days.Herds of elephants continue to create a nuisance destroying their crops and cultivation. Not only nights but, elephants have started coming to the village even during broad daylight. It may be recalled that a few days ago, two wild elephants entered Gopalpur village in Matia in broad daylight and created havoc in the village area. The villagers are more frightened by the frequent movement of elephants along the main route of the village. As a result, people have turned to God to save the village from wild elephants.In another interesting news,  Nature lover Binod Dulu Bora and senior citizen Pradeep Kumar, have taken an initiative wherein they are successfully mitigating human-elephant conflict in Hatikhali-Ronghang village along the along the Nagaon-Karbi Anglong border.Under their “hatibondhu’ initiative they are providing food to the flock of wild elephant herd in an area of 250 bighas of land in the field with the support and cooperation of the villagers of Hatikhali-Ronghang village in elephant end of Karbi Hills. Not only night, but the wild elephants are moving around majestically in the daytime, without creating any ruckus around the village."},
  {"title":"Assam: ‘Hatibondhu’ initiative successfully mitigating human-elephant conflict in Hatikhali-Ronghang village", "des":"As their habitats shrinks, elephants are progressively forced into closer contact with people resulting in human-elephant conflict which ultimately leads to loss of life. ", "img":"https://www.dropbox.com/s/wlk9lnmwythjlov/ele.jpg?dl=1", "info":"Human-elephant conflict is a major conservation concern in Assam. Expansion of human settlements and agricultural fields has resulted in widespread loss of elephant habitat. As their habitats shrinks, elephants are progressively forced into closer contact with people resulting in human-elephant conflict which ultimately leads to loss of life. But, today, we have a very different and unique story where human and elephants are sharing common ground for food. Yes, you read it right ! It’s been 9 days and a paddy field in Hatikhali-Ronghang village along the Nagaon-Karbi Anglong border witnesses a rare view of both men and elephants flocking together. All thanks to nature-loving youth Binod Dulu Bora and senior citizen Pradeep Kumar, under whose leadership and initiative of the nature-loving organisation ‘Hatibandhu’, the organisation has entered its fourth year to provide food to the flock of wild elephant herd in an area of 250 bighas of land in the field with the support and cooperation of the villagers of Hatikhali-Ronghang village in elephant end of Karbi Hills. Not only night, but the wild elephants are moving around majestically in the daytime, without creating any ruckus around the village. Villagers are overwhelmed by the free movement of the elephants and are not at all worried about the jumbos entering the fields, as the genteel animal flock move around in their groups without harming the human areas.For the past seven days, wild elephants have been eating paddy day and night but have created no menace thus allowing the farmers to cut their crops effortlessly. However, Dulu Bora plans to keep the wild elephants busy in the fields of Ronghang for the next two weeks.It is worth mentioning here that a number of young men and women are now thronging the Hatikhali-Ronghang field to conduct research and collect information on this innovative plan of Hathibandhu, which has been trying to prevent elephant-human conflict.Dulu Bora plans to keep the wild elephants busy in the fields for the next one week. If this special faming activity is concluded smoothly, it will definitely be a success story and a great example of how human-elephant conflict can be avoided and prevented without resorting to violence."},
  {"title":"Assam: Golakganj youth burnt to death in Odhisa", "des":"As per police investigation, Modak was working as a driver for a transport company Balaji Logistics of Hooghly, and was heading towards Howrah in West Bengal from Hyderabad when the incident took place. ", "img":"https://www.dropbox.com/s/es9rtz8vvfsjx2x/killer.webp?dl=1", "info":"A youth from Assam's Golakanj was found dead in the Chatrapur area in Odisha on November 23.The youth, identified as Govind Modak, was burnt to death in the Chatrapur area of Odisha and was a truck driver by profession.As per police investigation, Modak was working as a driver for a transport company Balaji Logistics of Hooghly, and was heading towards Howrah in West Bengal from Hyderabad when the incident took place. The incident came to light when the truck’s handyman, Anant Bhowmik, who works with Govind informed the manager of Balaji Logistics that Govind is missing and is nowhere to be found. Bhowmik further informed that on their way from Hyderabad to Howrah, Govind got down midway and had asked him to meet him in Howrah. ''But, even after 6 days of reaching Howrah when Govind did not reach Howrah'', he informed the office manager. An FIR was registered in the local police station and after days of investigation, the police found Govind Modak’s dead body at Ganjam in Chhatrapur, Odisha. It may be recalled that Govind Modak was allegedly burnt to death. Govind Modak's family members went to Chhatrapur, identified the body, and performed the last rites there. Meanwhile, members of the All Assam Garia Maria Desi Jatiya Parishad, Dhubri district, has ordered a judicial probe into the incident and demanded that the culprits should be punished and hanged to death. They have also requested Assam Chief Minister Himanta Biswa Sarma to provide financial assistance to the family since Govind Modak was the sole breadwinner of the family and they have none to look after them now."},
  {"title":"Assam wildlife activist Dr Purnima Devi Barman bags UN's highest environmental honour", "des":"Purnima Devi Barman is known for her work in conserving the greater adjutant stork and has bagged the award alongside four others from different nations.", "img":"https://www.dropbox.com/s/53h86c0i4eteky0/wing.webp?dl=1", "info":"A wildlife biologist from Assam, Dr Purnima Devi Barman, who is leading India's “Hargila Army,” an all-female movement protecting the Greater Adjutant Stork from extinction, has been conferred the highest environmental honour of the United Nations (UN), 'Champions of the Earth', for the year 2022.The United Nations Environmental Programme (UNEP) was announced on November 23.The renowned wildlife activist is known for her work in conserving the greater adjutant stork and has bagged the award alongside four others from different nations. Know as 'Hargila Baidew' (Stork Sister), a Green Oscar winner, Dr Purnima Devi Barman, has been fighting for the survival of the Greatest Adjutant Stork for almost two decades by founding an all-woman grassroots conservationist group.Women in the organisation, in particular, manufacture and sell textiles with Greatest Adjutant Stork designs, helping to increase awareness about the species while also establishing their own financial independence.The UN Environment Programme's Champions of the Earth award recognises people and organisations whose activities have a transformational influence on the environment. The yearly Champions of the Earth award is the highest environmental honour bestowed by the United Nations. It honours great leaders from government, public society, and business."},
  {"title":"Assam: Burglars attempt to loot Dominos pizza outlet in Guwahati's Ganeshguri area", "des":"The robbers attempted to open the cash locker by using various tools, however, they were unsuccessful in their attempt.", "img":"https://www.dropbox.com/s/1rhmgjyivot3nb3/shop.webp?dl=1", "info":"A gang of robbers tried to loot a Dominos Pizza outlet on November 23 in the Nayanpur locality in Guwahati's Ganesghguri.As per reports, the incident took place at around 4 am, when the robbers broke into the Dominos outlets in the Nayanpur area and tied one staff with a rope.The robbers attempted to open the cash locker by using various tools, however, they were unsuccessful in their attempt.Upon receiving the information of the same, a team of police arrived at the spot and took the staff with them for questioning.Notably, such incidents have seen a rise in the past few days as one lost his life while some lost their belongings.On the morning of November 22, two motorcycle-borne youths had snatched a handbag of a woman in the city's Down Town area. Reportedly, she was standing with another woman when the miscreants snatched her handbag, containing a gold ring, a mobile phone, and cash.Prior to this incident, on November 21, Ranjit Bora, Manager of Purabi Dairy shot dead in broad daylight in Guwahati's Panjabari area.According to reports, the incident took place when the victim was on his way to the bank to deposit money in ICICI bank. Following the incident, Bora was immediately taken to Gauhati Medical College and Hospital (GMCH) for treatment, however, he succumbed to his injuries.Locals alleged that some unknown miscreants on a bike (hero glamour) opened fire at him and snatched away his cash which was supposed to be deposited in the bank."},
  {"title":"Assam-Meghalaya border firing: Justice Rumi Phukan to conduct probe, judicial report to be out in 60 days", "des":"The mortal remains of the Assam Forest Guard Bidya Singh Doley who was among the 6 who lost their lives in the firing incident at Mukroh are expected to be handed over to his family later today.", "img":"https://www.dropbox.com/s/pyf8496qtnayoj0/god.webp?dl=1", "info":"In the latest development to the Assam-Meghalaya border firing which claimed the lives of six people, the Assam cabinet on November 23, appointed Justice Rumi Phukan to conduct the probe.Further, as per reports, the judicial probe report on the matter will be out in 60 days.On the other hand, the mortal remains of the Assam Forest Guard Bidya Singh Doley who was among the 6 who lost their lives in the firing incident at Mukroh along the Assam Meghalaya border are expected to be handed over to his family today.For the first time a cabinet meeting was held at Assam house in Delhi, wherein, the cabinet has urged Justice Rumi Phukan to conduct a probe into the Assam-Meghalaya border firing incident, said Assam Cabinet Minister, Jayanta Mallabaruah said while addressing the media.  The cabinet has also decided that the CBI to intervene in the matter as the incident has been reported from both the states of Meghalaya and Assam.The minister also said that the cabinet has also approved the holiday list for the year 2023, wherein, 38 days are marked as gazetted holidays, 30 restricted holidays, and two-half holidays.The cabinet has also approved to the construction of a Sericulture college in Titabor, for which Rs 22.50 crore has been earmarked by the government of Assam.Taking to his social media handle, Assam CM Himanta Biswa Sarma wrote, In a Cabinet meeting today, we expressed deep concern and condolences at the death of 6 persons and injuries caused to several others in an unfortunate police-civilian conflict situation in West Karbi Anglong. We decided to request Hon Justice Smt Rumi Phukan, Retd Judge of Gauhati HC, to conduct a judicial probe into facts & circumstances that led to the incident & conclude the enquiry within 60 days. Our Cabinet also decided to hand over the related police investigation to CBI. We advised Police to restrain the use of lethal weapons while dealing with the civilian population. SOPs for Police as well as Forest personnel will be prepared to deal with such a situation. All police stations in charge will be properly sensitised on such matters."},
  {"title":"Assam Government has failed to maintain law and order in the state, CM should resign: Akhil Gogoi", "des":"Addressing a press conference in Sivasagar, Gogoi said that the violent incident in the Mukroh area of West Jaintia Hills was unfortunate and that such an incident should not occur when Assam is trying to resolve inter-border issues with other Northeastern states.", "img":"https://www.dropbox.com/s/s4lfo65lczycq58/gover.webp?dl=1", "info":"After the violent incident that took place on the Assam-Meghalaya border which claimed 6 lives including one Assam Forest Official, MLA Akhil Gogoi on November 23  slammed Chief Minister Himanta Biswa Sarma and said that if the Chief Minister has the slightest public shame, then he should resign immediately. Addressing a press conference in Sivasagar, Gogoi said that the violent incident in the Mukroh area of West Jaintia Hills was unfortunate and that such an incident should not occur when Assam is trying to resolve inter-border issues with other Northeastern states. He said that not only the incident is unfortunate but the role of the Assam Government post the incident is even more unfortunate. “Even though an Assam Forest official was killed in the violent clash, Government took action against the Superintendent of Police and officer in Charge of West Karbi Anglong district. Instead of finding and punishing the miscreants, Assam Government punished its own people... This is probably ‘Hitler Rule’ which the BJP under Himanta Biswa Sarma is carrying out in Assam,” Akhil Gogoi said. Gogoi also lambasted Chief Minister Sarma and said that instead of visiting the incident site he is busy campaigning in Delhi and Gujarat, adding, ''Not even a single cabinet minister from Assam has visited the incident site so far''. He said that prior to this, Assam has been attacked several times by other NE states and this is actually a punishment given to the people of Assam. ''Most of the inter-border state violence have occurred after Himanta Biswa Sarma became the Chief Minister further added that all these violent incident shows and indicates Himanta Biswa Sarma’s failure to maintain law and order in the state,'' he avowed. Gogoi even demanded Assam Government declare the forest official as a martyr who died in the attack and added, ''Incidents of violence are increasing day by day in Assam.'' Reacting to the recent incident of the Purabi Dairy killing, Akhil Gogoi said that people are no more safe in Assam and that Himanta Biswa Sarma and his government are failing to maintain law and order in the state.  Akhil Gogoi also slammed Meghalaya Chief Minister Conrad Sangma for the incident and demanded to provide security for the stranded people and also for the people of Assam living in Meghalaya."},
  {"title":"Assam-Meghalaya border firing: Injured Assam forest guard narrates the horrific incident, claims was first attacked by sharp weapon", "des":"Abhimanyu Das, the forest guard, who was allegedly attacked with a sharp weapon, by the enraged mob in Mukroh village, in West Jaintia Hills in Meghalaya has claimed that the area is notorious for timber smuggling.", "img":"https://www.dropbox.com/s/y40e15lm5xujrdh/pati.webp?dl=1", "info":"Following the sensational firing incident that led to a volatile situation along the Assam-Meghalaya border on November 22, the forest guard who was injured during the skirmish has narrated the entire incident that unfolded on the unfortunate day. Abhimanyu Das, the forest guard, who was allegedly attacked with a sharp weapon, by the enraged mob in Mukroh village, in West Jaintia Hills, Meghalaya has claimed that the area is notorious for timber smuggling.“Illegal timber was being smuggled on the Assam-Meghalaya border on Tuesday, November 23 morning. At the same time, on being signalled by on-duty forest guard to stop the vehicle, the truck fled from the spot. After this, a joint team of police and the forest department fired bullets and punctured the tyres of the vehicle, after which the police arrested the driver, the handyman, and one other person, while few others managed to escape from there. After this, these three accused were handed over to the Jirikinding police of West Karbi Anglong,'' Das said.“While demanding the release of the arrested, a crowd of nearly hundreds armed with sharp weapons attacked the forest personnel and the police towards Meghalaya. In retaliatory action, the police started firing, after which six people, including a forest worker, lost their lives in this incident, and many were seriously injured, who have been treated in Hojai's hospital,” Das added.On the other hand, Abhimanyu Das, who was injured in the skirmish, told the media, “Like everyday, on Tuesday morning, the police and forest department team were inspecting in the border area. Right at the said Assam-Meghalaya border, the team spotted a truck full of huge wooden logs and intercepted it. During this, the team seized the said truck detaining three people. Meanwhile, sensing their intentions, the team punctured the tyres of the truck. On the other hand, on getting the news of the Meghalaya truck being caught by the Assam police, two hundred to two hundred and fifty people carrying sharp weapons came out and gheraoed the police team.”“Meanwhile, someone attacked me on the head with a weapon from behind. After that, I started feeling dizzy and firing also started. After this, my colleague somehow took me out of the car and brought me for medical treatment,” added Das.“Someone hit my head with a sharp weapon, due to which my head burst and blood started flowing profusely and I fell down. Just then I heard the sound of firing. But I could not find out whether the firing started from any side. There were two hundred to two hundred and fifty people, that too with sticks, knives, swords, and other weapons,” said Das while further adding, “By destroying the forests of Assam, the people of Meghalaya are continuously smuggling wood, many small and big incidents used to happen earlier also to obstruct this work. In this way, on Tuesday morning, while illegally smuggling wood from Assam, the team who was standing their, seized the vehicle carrying the smuggled wood, which was forcibly seized by a crowd of miscreants who attacked the police team. As a result of which this incident happened”."},
  {"title":"Assam: 63-year-old gets life imprisonment under POCSO Act on charge of raping minor", "des":"Ali, who is over the age of 60, took advantage and committed heinous nature, when there was no one in the house and raped the minor girl.", "img":"https://www.dropbox.com/s/qe2duaknopri5do/gran.webp?dl=1", "info":"A local court in the Dhubri district of Assam on November 23 sentenced a 63-year-old man to life imprisonment under the POCSO Act for sexually molesting a minor girl.Notably, the POCSO Court awarded the quantum of sentence to the convicted person, identified as Amjad Ali, after carefully perusing the case record in Dhubri district on November 23.He allegedly raped a nine-year-old girl, who is a resident of the Tamarhat area in the Dhubri district.Ali, who is over the age of 60, took advantage and committed heinous nature, when there was no one in the house and raped the minor girl.The convict committed the inhuman and barbaric act of rape and giving her lifelong trauma and threatening her not to divulge the incident to anyone.Uttam Kumar Sarkar learned Special Public Prosecutor stated that the victim was rapped by Ali, while she was washing clothes in her backyard from where Ali took her to his home and raped the nine-year-old girl. Later, the victim told her family members about the incident, listening to her the family members along with other villagers nabbed the accused and register a complaint at Tamarhat Police station.On the basis of the said complaint, Tamarhat Police station registered a case against the accused person namely Amjad Ali, following Case No-11/2022 U/S- 376 AB IPC R/W Sec 6 of POCSO Act, and the matter was taken up for investigation.Upon completion of the investigation, the IO of the case Jayanta  Kumar Das then OC Tamarhat submitted Charge Sheet against the accused Amjad Ali under POCSO Act, and accordingly, the case was registered as Special Case in the year 2022.Meanwhile, the Additional Sessions Judge cum Special Judge, POCSO, on her judgment dated 23/11/2022 stated that In the instant case, the convic-accused has raped a young minor girl who was helpless, defenceless, vulnerable and an easy prey. After listening to both sides and after the positive forensic report, an order was issued, wherein, Amjad Ali was sentenced to life imprisonment and fined Rs 50,000 by the court of Additional Sessions Judge and Special Court (POCSO) Polly Katoki, Dhubri. A penalty has also been levied for additional 6 months additional imprisonment under Section 6 of the Protection of Children from Sexual Offences (POCSO) Act."},
  {"title":"Assam: Parents protest against school fee hike in Barpeta", "des":"As per reports, Adarsha Vidyalaya, a model school in Barpeta had issued an order wherein the parents were asked to pay Rs 300 as monthly fees to the school.", "img":"https://www.dropbox.com/s/4o8ywrfh6w50aye/prise.webp?dl=1", "info":"Miffed over the collection of Rs 300 as fees in a school, the parents on November 23 protested and submitted a memorandum to the managing director demanding the cancellation of the fees.As per reports, Adarsha Vidyalaya, a model school in Barpeta had issued an order wherein the parents were asked to pay Rs 300 as monthly fees to the school.However, parents did not agree and adhere to the notice and protested against the order demanding the school authority to withdraw the order. Parents claim that their children should get the Right to Education at a minimum fee. In a time, when the central government is encouraging free and compulsory education for all, parents claim that the fees charged by Adarsha Vidyalaya are against the government norms and the Right to Education Act. Notably, in May 2021, Assam Government had asked private schools to keep fees within a government-set limit."},
  {"title":"Assam: Massive fire engulfs in Karbi Anglong district, over 200 houses destroyed", "des":"Meanwhile, four fire tenders each from Dimapur, including Bokajan were pressed into action to douse the flames.", "img":"https://www.dropbox.com/s/idcbrb56vc09y50/fire.jfif?dl=1", "info":"A major fire broke out at Lahrijan on the Assam-Nagaland border in the Karbi Anglong district on November 23.Notably, the flames engulf the entire area and led to destroying over half a dozen of business establishments and 200 houses.However, the reason for the fire is yet to be known.Meanwhile, four fire tenders each from Dimapur, including Bokajan were pressed into action to douse the flames along with police officials from the Khatkhati police station were deployed to control the situation.Earlier on October 24, a fire broke out in Golaghat amid the festivities of Diwali on October 24. As per sources, the house of one Pradeep Saikia, a resident of the Arengapara area of Golaghat town, was completely gutted in the fire. Notably, all important documents and materials on the upper floor of the person's house were completely gutted in the flames of the fire. Goods worth around Rs 2 lakh, including gold ornaments, furniture, and other items, were gutted in the fire. Later, the fire brigade managed to douse the fire, however, the residence was already gutted. While it is not yet known what caused the fire, an electrical short circuit is suspected to have triggered the fire.I was away at work when I received a call that my house is under fire, the entire floor has been burnt down, and I yet to understand what caused the fire, the victim said while speaking to the media."},
  {"title":"APS Indranil Barua appointed new SP of West Karbi Anglong post Assam-Meghalaya border firing incident", "des":"APS Indranil Barua was appointed as the district's new Superintendent of Police (SP) on Wednesday, November 23 after the dismissal of top officials following the firing incident along Assam-Meghalaya border.", "img":"https://www.dropbox.com/s/b7g8wroyrlq31zp/circe%3Be.webp?dl=1", "info":"Following the dismissal of top police officials in West Karbi Anglong post the violence that flared along Assam-Meghalaya border on November 22, APS Indranil Barua was appointed as the district's new Superintendent of Police (SP) on Wednesday, November 23.The Assam Police Service official had previously served as the commanding officer of the Assam Police's 23rd Battalion.This comes after former West Karbi Anglong SP Imdad Ali was transferred following the unrest along the state's border with Meghalaya after six civilians including one Assam forest guard died in a skirmish that ensued on November 22.Imdad Ali, meanwhile, has been assigned to the 23rd Assam Police Battalion.It should be noted that an incident of firing occurred on Tuesday, November 22 morning between Assam Forest Officials and unknown miscreants at Mukroh, Jirikinding PS, West Karbi Anglong District. The incident allegedly occurred when the Forest Protection Force attempted to stop a truck transporting illegal timber.When the forest party personnel stopped the truck, they were gheraoed by villagers carrying sharp objects who resorted to violence. To save their lives, the police team who had gone to retrieve the smuggled timber-laden truck in Mukhrow village, allegedly resorted to shooting in self defence. Five civilians and one forest guard from Assam were killed in the incident."},
  {"title":"Assam DGP Bhaskar Jyoti Mahanta among 500 police officials to receive award from Union Home Ministry", "des":"Assam DGP Bhaskar Jyoti Mahanta among five hundred officers and policemen across all ranks of Assam Police will be awarded the Police Antrik Suraksha Seva Padak for the Northeast (NE) Region", "img":"https://www.dropbox.com/s/xr78d6p5innc4s4/police.webp?dl=1", "info":"Assam Director General of Police, Bhaskar Jyoti Mahanta among five hundred officers and policemen across all ranks of Assam Police will be awarded the Police Antrik Suraksha Seva Padak for the Northeast (NE) Region.The award will be given by the Union Ministry of Home Affairs.Name and rank are as follows-1. Bhaskar Jyoti Mahanta, IPS, Director General of Police, Assam2. Satyendra Narayan Singh, IPS, Spl. Director of Police (Comm), Assam, Guwahati3. Anurag Agarwal, IPS, Inspector General of Police (T&AP). Assam, Guwahati.4. Dhananjay Parashuram Ghanwat, IPS. Asst. Inspector General of Police (A), Assam5. Amanjeet Kaur, IPS, Asst Inspector General of Police (Admi), Assam Guwahati6. Prateek Vijoy Kumar Thube IPS, SP Kokrajhar7. Mulesh Uddin Ahmed, APS, Commandant, 22nd AP (IR) Bn, Likabali, Dhemaji8. Diganta Kumar Choudhury, APS, Deputy Commissioner of Police, Guwahati9: Longnit Terang APS, Asst. Inspector General Police (L&O), Assam, Guwahati10. Jayanta Sarathi Borah, APS, Asst. Inspector General of Police (AP), Assam, Guwahati11. Papori Chetia, APS, Addl. Supdt. of Police, Special Branch Kahilipara, Guwahati12. Deborishi Choudhury, APS, Addl. Supdt, of Police (HQ), Charaideo"},
  {"title":"Assam: Patients suffer as Kamala Miri Civil Hospital of Bokakhat runs out of doctors", "des":"The shortage of doctors in Swahid Kamala Miri Civil Hospital is not only affecting the healthcare system but patients visiting the hospital are also facing problems in getting proper and on-time treatment.", "img":"https://www.dropbox.com/s/xyyd4q1244kr308/hospital-sixteen_nine.webp?dl=1", "info":"Swahid Kamala Miri Civil Hospital in Bokakhat of Golaghat district is in a pathetic condition as there is only one doctor attending to the patients. The OPD is closed due to the lack of doctors. There is only one doctor who is looking after both the OPD and Emergency sections. Most of the hospital doctors are on leave or might have been transferred or promoted leaving the hospital empty. The shortage of doctors in Swahid Kamala Miri Civil Hospital is not only affecting the healthcare system but patients visiting the hospital are also facing problems in getting proper and on-time treatment. “My father is admitted to the hospital and I have been continuously visiting the hospital for the last 4 days looking for a doctor. I got to know that there is only one doctor who is looking after the patients in the hospital. How can a single doctor look after so many patients in such a big hospital? ,”  a visitor visiting the hospital with his father said. “ We will not issue tickets now because we have a shortage of doctors”, said another person who went to the hospital for treatment. Due to the lack of doctors in the hospital surgeries of maternity patients are being performed on two specific days in a week. Similarly, there is a shortage of adequate medicines in the hospital. Dentists and Orthopedic surgeons are available only two days a week. Interestingly, ultrasound machine can also be seen often malfunctioning. Although the hospital is big in size and is beautifully decorated, lack of doctors in Swahid Kamala Miri Civil Hospital is making the situation more worse and people visiting the hospital for treatment are suffering to a great extent."},
  {"title":"Assam: Police seize drugs worth Rs 40 lakh in Silchar", "des":"A team of police led by Additional Superintendent of Police (ASP), Crime Branch, Kalyan Kumar Das intercepted a vehicle on the Trunk road in the city and upon searching, the drugs were seized.", "img":"https://www.dropbox.com/s/aizgbo493vpa7eq/sild-sixteen_nine.jpg?dl=1", "info":"Assam Police on November 23 seized 400 grams of heroin which were kept in 30 soap boxes in the state's Silchar town.As per reports, a team of police led by Additional Superintendent of Police (ASP), Crime Branch,  Kalyan Kumar Das intercepted a vehicle on the Trunk road in the city and upon searching, the drugs were seized.The police also arrested two alleged traffickers identified as Shahid Mohammad Laskar and Shawhaz Hossain Majumdar, a resident of Madhurbandar in Silchar. The arrested traffickers were carrying the drugs from the neighbouring state of Manipur.As per the Cachar Superintendent of Police (SP) Numal Mahatta, the market value of the seized drugs is around Rs 40 lakh.In another such seizure, the state police on November 21 seized 15.38 grams of drugs worth Rs 10 lakh in the Hailakandi district of Assam.The police conducted a raid and seized 47 empty containers containing drugs from a house in Tikar Basti of Rangauti under the Hailakandi Sadar police station.Apart from seizing drugs, the police also apprehended three drug peddlers, identified as Dilhara Begum Laskar, Salma Begum Laskar, and Hifzur Rahman Laskar. ''The Hailakandi police have already arrested the three men and are interrogating them'', the police officer said.In October this year, the state police had also seized 38 sacks of Burmese supari at the Jamira police patrol post along the Assam-Mizoram border in the Hailakandi district"},
  {"title":"Assam CM Himanta Biswa Sarma reacts to firing incident, says police could have exercised more restraint", "des":"Earlier in the day on November 22, the Assam government had ordered a judicial probe into the incident wherein a retired judge of Gauhati High Court is supposed to investigate the matter. ", "img":"https://www.dropbox.com/s/yf9cqsg3nqcc217/himanta_7-sixteen_nine.webp?dl=1", "info":"In his first reaction to the Assam-Meghalaya border firing incident in which six people including a forest guard from Assam died, Assam Chief Minister Himanta Biswa Sarma said that Assam Police could have exercised restraint in the heat of the incident on November 22.“Assam-Meghalaya incident is not a border issue. Few people in the forest area had gone there to cut timber and load them onto a truck. Upon reaching the spot, Assam’s Forest Protection Force tried to intercept the truck which allegedly fled from the scene and the protection force had to fire at the truck. After a hot chase, three persons were arrested after the truck was stopped at Mukroh village. The villagers after hearing the commotion came out in anger. When a police team from Assam reached the village to bring the truck, a clash ensued between the two parties. After observation, I believe police could have exercised restraint. It seems it was an unprovoked firing. Police could have exercised restraint because the loss of lives of five persons is painful,” said Assam Chief Minister Himanta Biswa Sarma while speaking to the media on November 23.Assam CM Himanta Biswa Sarma further added that the cabinet has ordered a judicial enquiry as well as requested central agency CBI or NIA’s investigation into the Assam-Meghalaya border firing incident.“Few police officials have been suspended while the SP has been transferred. Our government is initiating all possible action to expedite the matter at the earliest,” added CM Sarma.It needs mention here the Assam government has decided to hand over the case to the central agency. Earlier in the day on November 22, the Assam government had ordered a judicial probe into the incident wherein a retired judge of Gauhati High Court is supposed to investigate the matter. Tension flared up on November 22, in West Karbi Anglong when Assam police and a team of forest officials gave a hot chase to a smuggled timber-laden truck after being intercepted by the forest guards. Following the chase, the team entered Mukroh village, West Jaintia Hills in Meghalaya, bordering Karbi Anglong district of Assam.As per sources, a huge crowd allegedly gheraoed the police team holding sharp weapons in their hands. The police team then allegedly opened fire in self-defence in which 6 people have been reported dead including one Assam forest guard."},
  {"title":"Assam: Burmese Supari seized in Hailakandi", "des":"In a similar incident, earlier on November 22, Assam Police had seized a huge amount of Burmese Supari at Assam- Mizoram border in Hailakandi district.", "img":"https://www.dropbox.com/s/kvnvlcgg1nuy637/burmese_supari-sixteen_nine.jpg?dl=1", "info":"Assam Police on November 23 seized Burmese supari loaded inside a truck in the state's Hailakandi district.The seizure was made during Naka checking Bilaipur police intercepted a truck bearing registration number NL 01 AB 9916 which was on its way to Silchar from Mizoram.In connection with the matter, the Police have detained the truck driver and seized the truck as well. In a similar incident, earlier on November 22, Assam Police had seized a huge amount of Burmese Supari at Assam- Mizoram border in Hailakandi district. As many as 100 sacks of Burmese Supari were seized from a truck bearing registration number AS 11 JC 4450 that was intercepted near Assam- Mizoram border. The truck was reportedly travelling from Mizoram to Assam. The cost of the seized Burmese Supari was estimated to be Rs 10 lakh, police said. Earlier again on November 5, A huge quantity of Burmese supari was seized at Khatkhati in the Karbi Anglong district The estimated value of the seized supari would be around 25 lakhs."},
  {"title":"400th birth anniversary Celebrations of Bir Lachit Borphukan: Cultural rally held in Dhubri", "des":"Assam is currently celebrating and organizing week long programme celebrating the 400th birth anniversary of Bir Lachit Borphukan.", "img":"https://www.dropbox.com/s/h9w15rjztieay13/dhubri-sixteen_nine.webp?dl=1", "info":"In view of the 400th birth anniversary celebrations of Bir Lachit Borphukan, a colourful cultural procession was carried out at Raja Prabhat Chandra Baruah Ground in Dhubri . The initiative was taken and conducted by Dhubri District Administration in association with Simanta Chetna Mancha Purbottar, Dhubri along with few other organizations including various college's of Dhubri town on on November 23. Speaking to reporters, Deputy Commissioner of Dhubri district, Dibakar Nath said that 400th birth anniversary of Bir Lachit Borphukan is being celebrated with joy, fervor and happiness all over Assam including Dhubri district. Assam is currently celebrating and organizing week long programme celebrating the 400th birth anniversary of Bir Lachit Borphukan. The programme which started on November on 18 is scheduled to be celebrated till November 25.  A programme is being organized in New Delhi too from 23rd to 25th November 2022. During the event, a documentary based on the life of the Lachit Barphukan will also be launched. In February, this year, former President Ram Nath Kovind launched the celebration. The former President laid the foundation stone of a 150-foot bronze statue of Borphukan at Hollongapar in Jorhat, Assam.Government of Assam has also launched a portal and mobile application, so that more people can be involved. People can also send write-ups and essays to show their respect for the brave leader. Additionally, a theme song for the program was also released. The theme song pays tribute to the bravery and sacrifice of Barphukan. As part of the celebrations, various activities like blood donation camps, tree plantations and cultural activities are organized."}
]
