[
  {"title":"Assam-Arunachal boundary disputes likely to be resolved by November end: CM Pema Khandu", "des":"Khandu said that the love and cooperation of the people of Assam always inspire him to work with zeal and spirit to resolve border issues.", "img":"https://www.dropbox.com/s/zdz7na6mt7fyntp/khanduf-sixteen_nine.jpg?dl=1", "info":"Arunachal Chief Minister Pema Khandu on October 31 stated that the decades-old state's border issue with Assam will be resolved once and for all by the end of November 2022.“One more meeting will be held between me and my Assam counterpart Dr Himanta Biswa Sarma for a final agreement and permanent solution. Both of us are determined to resolve all our differences by the end of November,” Khandu said while speaking to reporters after a day-long meeting with a high-level delegation from Assam comprised of several Ministers and MLAs. He further said that today’s meeting can be termed the penultimate one in the series of meetings held between the two states after the historic Namsai Declaration.Khandu also said that following the Namsai Declaration, 12 Regional Committees each were formed by both Assam and Arunachal Pradesh, headed by Cabinet Ministers. These committees jointly visited the disputed areas, took feedback from people on both sides, and submitted their reports to their respective state governments.“Today, discussions were held on these reports district-wise in depth. I am happy that all reports are positive in effect and the committees of both the states have sincerely and jointly worked to find a permanent solution to this boundary issue,” he added.He said that if there is a strong political will no issue can remain unresolved for decades.He also expressed gratitude to Prime Minister Narendra Modi and Union Home Minister Amit Shah for their motivation and for being the guiding force in ensuring smooth communication between the two neighbouring states to resolve the boundary row out of court.“I have to thank Dr Himanta Biswa Sarma for personally stepping out to resolve the boundary row not only with Arunachal Pradesh but with all other North Eastern states that share boundaries with Assam.Khandu said that the love and cooperation of the people of Assam always inspire him to work with zeal and spirit to resolve border issues. ''We are determined to resolve the border issues for peace and harmony between the loving people of Assam and Arunachal Pradesh,” Khandu added."},
  {"title":"Shillong: Pressure groups violates Section 144 while taking out protest rally demanding ILP", "des":"The Hynniewtrep Youth Council (HYC), East Jaintia National Council (EJNC), Jaintia Students Movement (JSM), Hynniewtrep Achik National Movement (HANM), and Confederation of Ri Bhoi People (CoRP) launched the Save Hynniewtrep Mission in Meghalaya on Tuesday, November 1.", "img":"https://www.dropbox.com/s/dduz4sofc7zt5o3/yesss_2-sixteen_nine.jpg?dl=1", "info":"Protesters from five pressure groups marched to the Secretariat on Tuesday, November 1, in defiance of section 144 of the Criminal Procedure Code, which forbids gatherings of more than five people, in protest of the state government's refusal to respond to the nine-point charter of demands, which includes the implementation of the Inner Line Permit (ILP) in the state.The Hynniewtrep Youth Council (HYC), East Jaintia National Council (EJNC), Jaintia Students Movement (JSM), Hynniewtrep Achik National Movement (HANM), and Confederation of Ri Bhoi People (CoRP) launched the Save Hynniewtrep Mission on Tuesday, November 1.To avoid any unexpected incidents, the state capital was also placed under strict protection.Later, Lahkmen Rymbui, the home minister, also sent an invitation to the five pressure group leaders for a discussion of the concerns. They expressed dissatisfaction with the meeting's outcome, claiming that He (Rymbui) could not take any decision as the issues relate to the political department, which is not under his control.In a statement to reporters, HYC general secretary Roykupar Synrem stated that deputy chief minister Prestone Tynsong had urged all pressure group members to visit the secretariat instead of beating up individuals in the streets. “Based on that call given by the deputy CM, we have decided to march to the secretariat to meet and put question to them (ministers) as to what has happen to the resolutions related to the ILP and Khasi language, what happen to the report of the one man commission of inquiry which stated that the police are involved in the killing of ex-HNLC leader Cheristerfield Thangkhiew, what happen to the various charges of corruption, as to what the government is doing regarding the unemployment, job reservation policy as well as repealing of the casino act,” he said.“We came with that motive and objective to meet the people who are representing us but sadly we came to know that from now onwards if you want to meet your representative, you have to seek permission from the deputy commissioner. This is unfortunate as we have not had this kind of a situation before,” he added.Condemning the implementation of 144 CrPC throughout the state capital, Synrem claimed that this was nothing more than a government ruse to keep the public's voice at home by preventing people from taking to the streets to protest how it was operating.You cannot enact laws to prevent the people from protesting or from showing and exercising their rights, Synrem remarked, referring to Supreme Court rulings. We state unequivocally that we will not obey any laws of this nature or any orders issued by the district magistrate.When asked, Synrem said that actually they did not want to meet the home minister since they already knew it will not be a fruitful meeting and it will be just a waste of time. “But at the end we respect him as a home minister so we just went and informed him that today we have launched this Save Hynniewtrep Mission and that in the coming days the five organizations will further intensify agitations,” he said.  Meanwhile, the HYC leader further alerted the state government and the district administration to be prepared for more and more surprise agitations.“We will be announcing a series of agitations. Our members and volunteers will go to every place that the chief minister visits, that the deputy chief minister visits or any minister visit whether it is for their own party meeting or for official meetings - to remind and ask them as to what happened to these points of demands,” he said.He said that the timeframe put forth by the five pressure groups in the first phase of agitation is for the government to fulfill the demands before the model code of conduct is made effective in the state.“During this period there will be a series of agitations. After the model code of conduct is announced, we will sit and discuss our future course of action,” Synrem stated."},
  {"title":"Shillong: Police books FKJGP secretary in 15 cases over violent rally against ‘unemployment’", "des": "Speaking to reporters, Eldie Lyngdoh said he has been booked under section 341/324/353/505/506/34 of the Indian Penal Code (IPC) in Laitumkhrah and Sardar police station.", "img": "https://www.dropbox.com/s/902djajm1bbh1zw/untitled_design_13-sixteen_nine.webp?dl=1", "info": "General Secretary of the Federation of Khasi Jaiñtia and Garo People (FKJGP) Eldie N Lyngdoh has been slapped with 15 cases for the violence during the rally against ‘unemployment’ on October 28, by the FKJGP. FKJGP was joined by several other NGOs like KSU, RBYF, and HNYF in their march from Motphran to Madan Iewrynghep (Firebrigade Ground). During the rally, violence erupted with targeted attacks on non-locals or non-tribals by FKJGP members. The incidents, caught by the passers-by, have gone viral on social media since, denting the image of Shillong and Meghalaya all over the world, which had taken several years to build.  Meghalaya police have filed a suo moto case at Laitumkhrah Police Station and Sardar Police Station. Speaking to reporters, Eldie Lyngdoh said he has been booked under section 341/324/353/505/506/34 of the Indian Penal Code (IPC) in Laitumkhrah PS and Sardar PS. Lyngdoh said that whatever happened during the rally is the responsibility of the FKJGP as they are the ones who organised it. He also informed that he has been summoned again by the police on November 4."}
]
